// && - І

// Я піду гуляти якщо зроблю домашнє завдання і помию посуд
// Я піду гуляти якщо зроблю домашнє завдання

// і помию посуд

//true && true - я їду гуляти
//false && true - ми не їдем гуляти
//false && false - ми точно не їдем гуляти

// || - АБО

// Я пійду гуляти коли помию підлогу або зроблю домашнє

// Я пійду гуляти коли помию підлогу

//  зроблю домашнє

// true || false - Ідем гуляти
// false || true -Їдем гуляти
// false || false - не їдем

// ! - НЕ

// !true - не тру - false
// !false - не фалсе - true
